English.org
* My English Notebook
** Bo Bin Grammar
*** Chapter 1 Introduction
**** English Introduction
**** Nature of This Book
**** The Word Class
***** National Word
      - noun :: book, water
      - pronoun :: I, you
      - adjective :: clear, happy
      - numeral :: four, sixty
      - verb :: come, take
      - adverb :: here, today, yes, no
***** Form Word
      - article :: a, the
      - preposition :: of ,to
      - conjunction :: and, or
      - inerjection :: oh, alas
***** Phrase
      - phrasal verb :: get up, call on, take care of
      - phrasal preposition :: because of, instead of
      - phrasal conjunction :: as if, so that, as long as
***** Subordinate Correlative
      who, how, when
**** Sentence Element
***** Subject Group - Predicate Group
       - _Professor Ward_ _teaches English to university students_.
***** Six sentence elements
       1) Subject
          - The /*sun*/ is shining in our faces.
          - /*I*/ respect his privacy.
       2) Predicate or Predicate Verb
          - Twilight /*was falling*/ as Martin /*left*/ the fruit store.
          - The play began at eight, so they /*must dine*/ at seven.
       3) Object
          - One must endorse a /*cheque*/ before one cashes it.
          - Thomas received a /*warning*/ for /*speeding*/.
          - She gave a /*roar*/ of /*pain*/.
       4) Complement and Predicative
          - Hill was declared the /*winner*/ of the fight.
          - I consider the book /*expensive*/.
          - John Stuart Mill was an early /*feminist*/.
       5) Attribute
          - The /*whole*/ house was ill with the mumps.
          - John had a /*great*/ desire /*to travel*/.
          - Children /*who live by the sea*/ usually begain to swim at an early age.
       6) Adverbial
          - Alex did /*badly*/ on exam.
          - Houses are /*so*/ expensive now that we /*simply*/ can't afford to buy one.
          - /*Frankly*/, I don't think the plan will succeed.
          - He ran up to her /*breathing heavily*/.
          - /*As I approached*/, Reid gave me a nod of greeting.
***** Independent Element of The Sentence
       - -- Is it rainning?
         -- /*No*/, it's snowing.
       - /*Miss*/, what time is flight 452 for Boston due to depart?
       - Karl bought /*a*/ video recorder.
       - Where is /*the*/ Caribbean Sea?
       - My car break down /*on*/ the highway.
       - This fact has little significance /*for*/ us.
       - Discussion /*and*/ debates are my favourite way of learning.
       - You had to have a job /*or*/ go hungry.
       - Most students in the class score eighty percent and above, /*but*/ John is the exception.
       - Henry is afraid he'll gain weight /*if*/ he stop smoking.
       - /*Althought*/ it was barely four o'clock, the light were already on.
       - /*Oh*/, please don't ask me any more.
**** The Phrase
    1) Noun Phrase
       - My cousin is /*a university student*/.
       - /*Brown's formal title*/ is "Professor", but he prefers to be called "Mr".
    2) Verb Phrase
       - I /*can't believe*/ John has failed.
       - The new books /*will have been entered*/ in the register before another parcel arrives.
    3) Adjectival Phrase
       - Her little stories are /*very charming indeed*/.
       - The clouds soon cleared away and it became /*quite warm*/.
    4) Adverbial Phrase
       - Joan plays the piano /*very nicely*/.
       - He didn't work /*hard enough*/ and so he failed the examination.
    5) Prepostional Phrase
       - The car is waiting /*at the gate*/.
       - The earth goes /*round the sun*/.
    6) Infinitive Phrase
       - /*To eat three times a day*/ is heathy.
       - Your job will be /*to look after the children*/. 
    7) Gerundial Phrase
       - /*Watching TV*/ is a pleasure.
       - Mary's mother enjoys /*listening to music*/.
    8) Participial Phrase
       - The woman /*washing the dishes*/ is my aunt.
       - /*Walking home*/, the girl was frightened by a noise.
       - /*When formed with copper*/, aluminum alloys are quite strong.
    9) Set Phrase
       - Dr. Smith is to leave /*at once*/.
**** The Clause
    1) Subject Clause
       - /*How this happened*/ is not clear to anyone.
       - /*That we shall be late*/ is certain.
    2) Predicative Clause
       - The trouble is /*that I have lost his address*/.
       - That is /*what he meant*/.
    3) Object Clause
       - The seller demanded /*that payment should be made within five days.
       - She asked me /*which I liked best*/.
    4) Attributive Clause
       - A man /*who sells books in a shop*/ is called a bookseller.
       - The man /*who I saw*/ is called Smith.
    5) Adverbial Clause
       - A telegram came /*after you had gone*/.
       - The house stood /*where three roads met*/.
       - /*If she asks me*/, I'll tell her.
       - /*So far as I know*/, he is trustworthy.
    6) Appositive Clause
       - The fact /*that the money has gone*/ does not mean it was stolen.
       - The suggestion /*that the new rule be adopted*/ came from the chairman.
**** The Sentence
***** Basic Structure
       1) SV
          - Day dawns.
       2) SVO
          - Ruth understands French.
       3) SVOO
          - He told us the whole story.
       4) SVC/SLP
          - He died a poor man.
          - Tom's father is professor.
       5) SVOC
          - He found George intelligent.
