English.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-08 Sun 09:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zhong Wei" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf22447f">1. My English Notebook</a>
<ul>
<li><a href="#orgda78894">1.1. Bo Bin Grammar</a>
<ul>
<li><a href="#orga3c1856">1.1.1. Chapter 1 Introduction</a></li>
<li><a href="#orgf983d92">1.1.2. Chapter 2 Noun</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf22447f" class="outline-2">
<h2 id="orgf22447f"><span class="section-number-2">1</span> My English Notebook</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgda78894" class="outline-3">
<h3 id="orgda78894"><span class="section-number-3">1.1</span> Bo Bin Grammar</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orga3c1856" class="outline-4">
<h4 id="orga3c1856"><span class="section-number-4">1.1.1</span> Chapter 1 Introduction</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org0d0bc59"></a>English Introduction<br /></li>
<li><a id="org191a578"></a>Nature of This Book<br /></li>
<li><a id="orga42469f"></a>The Word Class<br />
<ol class="org-ol">
<li><a id="org7678cc8"></a>National Word<br />
<div class="outline-text-6" id="text-1-1-1-3-1">
<dl class="org-dl">
<dt>noun</dt><dd>book, water</dd>
<dt>pronoun</dt><dd>I, you</dd>
<dt>adjective</dt><dd>clear, happy</dd>
<dt>numeral</dt><dd>four, sixty</dd>
<dt>verb</dt><dd>come, take</dd>
<dt>adverb</dt><dd>here, today, yes, no</dd>
</dl>
</div>
</li>
<li><a id="orge97a3eb"></a>Form Word<br />
<div class="outline-text-6" id="text-1-1-1-3-2">
<dl class="org-dl">
<dt>article</dt><dd>a, the</dd>
<dt>preposition</dt><dd>of ,to</dd>
<dt>conjunction</dt><dd>and, or</dd>
<dt>inerjection</dt><dd>oh, alas</dd>
</dl>
</div>
</li>
<li><a id="org80ae76b"></a>Phrase<br />
<div class="outline-text-6" id="text-1-1-1-3-3">
<dl class="org-dl">
<dt>phrasal verb</dt><dd>get up, call on, take care of</dd>
<dt>phrasal preposition</dt><dd>because of, instead of</dd>
<dt>phrasal conjunction</dt><dd>as if, so that, as long as</dd>
</dl>
</div>
</li>
<li><a id="org41a4b10"></a>Subordinate Correlative<br />
<div class="outline-text-6" id="text-1-1-1-3-4">
<p>
who, how, when
</p>
</div>
</li>
</ol>
</li>
<li><a id="org7ec079c"></a>Sentence Element<br />
<ol class="org-ol">
<li><a id="org1171fa6"></a>Subject Group - Predicate Group<br />
<div class="outline-text-6" id="text-1-1-1-4-1">
<ul class="org-ul">
<li><span class="underline">Professor Ward</span> <span class="underline">teaches English to university students</span>.</li>
</ul>
</div>
</li>
<li><a id="orga54ee91"></a>Six sentence elements<br />
<div class="outline-text-6" id="text-1-1-1-4-2">
<ol class="org-ol">
<li>Subject
<ul class="org-ul">
<li>The <i><b>sun</b></i> is shining in our faces.</li>
<li><i><b>I</b></i> respect his privacy.</li>
</ul></li>
<li>Predicate or Predicate Verb
<ul class="org-ul">
<li>Twilight <i><b>was falling</b></i> as Martin <i><b>left</b></i> the fruit store.</li>
<li>The play began at eight, so they <i><b>must dine</b></i> at seven.</li>
</ul></li>
<li>Object
<ul class="org-ul">
<li>One must endorse a <i><b>cheque</b></i> before one cashes it.</li>
<li>Thomas received a <i><b>warning</b></i> for <i><b>speeding</b></i>.</li>
<li>She gave a <i><b>roar</b></i> of <i><b>pain</b></i>.</li>
</ul></li>
<li>Complement and Predicative
<ul class="org-ul">
<li>Hill was declared the <i><b>winner</b></i> of the fight.</li>
<li>I consider the book <i><b>expensive</b></i>.</li>
<li>John Stuart Mill was an early <i><b>feminist</b></i>.</li>
</ul></li>
<li>Attribute
<ul class="org-ul">
<li>The <i><b>whole</b></i> house was ill with the mumps.</li>
<li>John had a <i><b>great</b></i> desire <i><b>to travel</b></i>.</li>
<li>Children <i><b>who live by the sea</b></i> usually begain to swim at an early age.</li>
</ul></li>
<li>Adverbial
<ul class="org-ul">
<li>Alex did <i><b>badly</b></i> on exam.</li>
<li>Houses are <i><b>so</b></i> expensive now that we <i><b>simply</b></i> can't afford to buy one.</li>
<li><i><b>Frankly</b></i>, I don't think the plan will succeed.</li>
<li>He ran up to her <i><b>breathing heavily</b></i>.</li>
<li><i><b>As I approached</b></i>, Reid gave me a nod of greeting.</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="orgd53b63c"></a>Independent Element of The Sentence<br />
<div class="outline-text-6" id="text-1-1-1-4-3">
<ul class="org-ul">
<li>&#x2013; Is it rainning?
&#x2013; <i><b>No</b></i>, it's snowing.</li>
<li><i><b>Miss</b></i>, what time is flight 452 for Boston due to depart?</li>
<li>Karl bought <i><b>a</b></i> video recorder.</li>
<li>Where is <i><b>the</b></i> Caribbean Sea?</li>
<li>My car break down <i><b>on</b></i> the highway.</li>
<li>This fact has little significance <i><b>for</b></i> us.</li>
<li>Discussion <i><b>and</b></i> debates are my favourite way of learning.</li>
<li>You had to have a job <i><b>or</b></i> go hungry.</li>
<li>Most students in the class score eighty percent and above, <i><b>but</b></i> John is the exception.</li>
<li>Henry is afraid he'll gain weight <i><b>if</b></i> he stop smoking.</li>
<li><i><b>Althought</b></i> it was barely four o'clock, the light were already on.</li>
<li><i><b>Oh</b></i>, please don't ask me any more.</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="org9c63bc7"></a>The Phrase<br />
<div class="outline-text-5" id="text-1-1-1-5">
<ol class="org-ol">
<li>Noun Phrase
<ul class="org-ul">
<li>My cousin is <i><b>a university student</b></i>.</li>
<li><i><b>Brown's formal title</b></i> is "Professor", but he prefers to be called "Mr".</li>
</ul></li>
<li>Verb Phrase
<ul class="org-ul">
<li>I <i><b>can't believe</b></i> John has failed.</li>
<li>The new books <i><b>will have been entered</b></i> in the register before another parcel arrives.</li>
</ul></li>
<li>Adjectival Phrase
<ul class="org-ul">
<li>Her little stories are <i><b>very charming indeed</b></i>.</li>
<li>The clouds soon cleared away and it became <i><b>quite warm</b></i>.</li>
</ul></li>
<li>Adverbial Phrase
<ul class="org-ul">
<li>Joan plays the piano <i><b>very nicely</b></i>.</li>
<li>He didn't work <i><b>hard enough</b></i> and so he failed the examination.</li>
</ul></li>
<li>Prepostional Phrase
<ul class="org-ul">
<li>The car is waiting <i><b>at the gate</b></i>.</li>
<li>The earth goes <i><b>round the sun</b></i>.</li>
</ul></li>
<li>Infinitive Phrase
<ul class="org-ul">
<li><i><b>To eat three times a day</b></i> is heathy.</li>
<li>Your job will be <i><b>to look after the children</b></i>.</li>
</ul></li>
<li>Gerundial Phrase
<ul class="org-ul">
<li><i><b>Watching TV</b></i> is a pleasure.</li>
<li>Mary's mother enjoys <i><b>listening to music</b></i>.</li>
</ul></li>
<li>Participial Phrase
<ul class="org-ul">
<li>The woman <i><b>washing the dishes</b></i> is my aunt.</li>
<li><i><b>Walking home</b></i>, the girl was frightened by a noise.</li>
<li><i><b>When formed with copper</b></i>, aluminum alloys are quite strong.</li>
</ul></li>
<li>Set Phrase
<ul class="org-ul">
<li>Dr. Smith is to leave <i><b>at once</b></i>.</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org878a61d"></a>The Clause<br />
<div class="outline-text-5" id="text-1-1-1-6">
<ol class="org-ol">
<li>Subject Clause
<ul class="org-ul">
<li><i><b>How this happened</b></i> is not clear to anyone.</li>
<li><i><b>That we shall be late</b></i> is certain.</li>
</ul></li>
<li>Predicative Clause
<ul class="org-ul">
<li>The trouble is <i><b>that I have lost his address</b></i>.</li>
<li>That is <i><b>what he meant</b></i>.</li>
</ul></li>
<li>Object Clause
<ul class="org-ul">
<li>The seller demanded /*that payment should be made within five days.</li>
<li>She asked me <i><b>which I liked best</b></i>.</li>
</ul></li>
<li>Attributive Clause
<ul class="org-ul">
<li>A man <i><b>who sells books in a shop</b></i> is called a bookseller.</li>
<li>The man <i><b>who I saw</b></i> is called Smith.</li>
</ul></li>
<li>Adverbial Clause
<ul class="org-ul">
<li>A telegram came <i><b>after you had gone</b></i>.</li>
<li>The house stood <i><b>where three roads met</b></i>.</li>
<li><i><b>If she asks me</b></i>, I'll tell her.</li>
<li><i><b>So far as I know</b></i>, he is trustworthy.</li>
</ul></li>
<li>Appositive Clause
<ul class="org-ul">
<li>The fact <i><b>that the money has gone</b></i> does not mean it was stolen.</li>
<li>The suggestion <i><b>that the new rule be adopted</b></i> came from the chairman.</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org94eeb30"></a>The Sentence<br />
<ol class="org-ol">
<li><a id="org74da71b"></a>Basic Structure<br />
<div class="outline-text-6" id="text-1-1-1-7-1">
<ol class="org-ol">
<li>SV
<ul class="org-ul">
<li>Day dawns.</li>
</ul></li>
<li>SVO
<ul class="org-ul">
<li>Ruth understands French.</li>
</ul></li>
<li>SVOO
<ul class="org-ul">
<li>He told us the whole story.</li>
</ul></li>
<li>SVC/SLP
<ul class="org-ul">
<li>He died a poor man.</li>
<li>Tom's father is professor.</li>
</ul></li>
<li>SVOC
<ul class="org-ul">
<li>He found George intelligent.</li>
</ul></li>
</ol>
</div>
</li>
