English.org
***** Sentence Structure
       1) Simple Sentence
          - Thomas Edison was born in Milan, Ohio, on February 11, 1847.
          - Fire and water do not agree.
          - Caroline came into the classroom and sat down.
       2) Compound Sentence
          - I came home early, but she remained to the end of the concert.
       3) Complex Sentence
          - He said he would come in the evening.
          - While the man worked to strenthen the dam, the rain continued to fall, and the river, which was already well above its normal level, rose higher and higher.
***** Purpose and use
      1) Declarative Sentence
         - The run rises in the east.
      2) Interrogative Sentence
         - Who is standing at the window?
      3) Imperative Sentence
         - Open the window, please.
      4) Exclamatory Sentence
         - How spotless the snow is!
*** Chapter 2 Noun
**** 概说
       1. 名词的定义和特征
          1) -s or -es
             - Jack shruggled his /*shoulders*/.
             - David stands six feet three /*inches*/.
          2) article
             - /*The chocolate*/ temporarily statisfied Ruth's /*hunger*/.
             - /*Some substances*/ resist /*the action*/ of /*acids*/.
          3) 固定的词序
             - The /*organ*/ played a solemn /*music*/.
             - The /*sun*/ evaporated the /*dew*/.
          4) 独特的后缀
             - -er, -or, -ment, -ness, -ion, -ity, -ance(-ence), -ure, -al
       2. 名词的种类
          1) Common Noun / Proper Noun
             - _John_ is a _student_.
             - Proper Noun :: 零冠词，首字母大写
          2) Common Noun
             - 类名词 :: book, table, house
             - 集体名词 :: family, crowd, army
             - 物质名词 :: milk, water, honey
             - 抽象名词 :: honesty, happiness, love
          3) 可数名词、不可数名词
             - 类名词和集体名词大多可数 :: a girl, a chair, a horse, a family, a tree, an army
             - 物质名词、动作和抽象名词大多不可数 :: milk, thinking, glass, anger, drinking, honesty
          4) 简单名词、复合名词
             - 简单名词 :: mother, opinion, society, vase, wine, work
             - 复合名词 :: raincoat, airman, sight-seeing, walking stick, self-consciousness, woman worker
       3. 可数名词与不可数名词的区分
          1) 可数 :: duty, hope, experience
          2) 不可数 :: soap
          3) 可数 :: Two coffees, please.
          4) 不可数 :: Do you want tea or coffee?
       4. 专有名词
          1) 人名
          2) 地名
          3) 时间名
          4) 报刊名
             - Time
             - Life
             - the Economist
             - the New Yorker
             - the Guardian
             - the Washington Post
          5) 单位团体名多含普通名词，常带定冠词。如：
             - the Conservative Party
             - the Central Intelligence Agency
             - the Associated Press
             - the British Museum
             - the United Nations
             - Congress
             - Parliament
             - Yale University
             - Brown University
       5. 复合名词
          1) 构成大致有九种
             1) 名词+名词 :: daylight, goldfish, handbag, nightdress, oil well, snowball, teapot, warhorse
             2) 名词+动词 :: rainfall, haircut, book-keeping, horse-riding
             3) 名词+副词 :: passer-by, hanger-on
             4) 动词+名词 :: turntable, washing machine, punchcard, chewing gum, swimming-pool, writing desk
             5) 动词+副词 :: break-in, make-up, take-off, warm-up
             6) 形容词+名词 :: greenhouse, blackboard, shorthand, blueprint
             7) 形容词+动词 :: dry-cleaning
             8) 副词+名词 :: onlooker, bystander
             9) 副词+动词 :: offset, outlet, income, downturn
          2) 形式有三种(连字符无规律，需查字典)
             1) 两部分连写 :: bookshop, motorcycle, lipstick, earrings, yearbook, tablecloth, fireplace, typewriter
             2) 两部分用连字符连接 :: ice-cream, baby-sitter, self-control, man-eater, drive-in, air-conditioning, summing-up, go-between
             3) 两部分分写 :: post office, toilet paper, film star, bus stop, side road, credit card, data bank, talcum powder
          3) 重音在第一个词上
             - a 'blackbird 以别于 a black 'bird
             - the 'White House 以别于 the white house
             - an 'English teacher "英语教师" 与 an English 'teacher 英国教师
       6. 名词化(substantivization)
          - 名词化的词类主要有下列四类
            1) 名词化的形容词 :: rich, dumb, poor, sick, blind, Scotch
            2) 名词化的过去分词 :: wounded, accused, unknown, beloved, outcast, firstborn
            3) 名词化的动名词 :: feeling, suffering, thinking, writing, printing, building
            4) 名词化的基数词、序数词 :: on all /*fours*/, in his /*sixties*/, from the /*first*/, need a /*fourth*/ in the game
          - 其他词类及短语用作名词
            - I am not a /*somebody*/, but a /*nobody*/.
            - Did you enjoy your /*swim*/.
            - Motion requires a /*here*/ and a /*there*/. 运动需要从这一点到那一点。
            - But me no /*buts*/. 你不要和我说”但是“、”但是“了。
          - 固定词组变成复合名词
            - to-do 吵闹
            - touch-me-not 含羞草
            - well-being 幸福，福利
            - has-been 过时的人或物
            - might-have-been 本可成功的人或本可做到的事
            - right-about-face 180 度大转弯
       7. 名词的功用
          1) 主语
             - The /*boy*/ broke his arm yesterday.
             - /*William wants to become a judge.
             - A /*watermelon*/ is much sweeter than a lemon.
          2) 宾语
             - We lost our /*way*/.
             - Jeanette rarely misses a football /*game*/.
             - They've been working from /*morning*/ to /*night*/.
          3) 补语
             - Mark is considered a good /*officer*/
             - The parents christened their son /*John*/.
             - The doctor is a /*specialist*/ in diseases of heart.
          4) 定语
             - The /*air*/ conditioning works well.
             - The /*ship's*/ crew stood on deck.
             - The /*humanities*/ professor didn't give us any home-work tonight.
          5) 同位语
             - Marilyn Monroe, a famous movie /*star*/, committed suicide.
             - Influenza, a common /*disease*/, has no cure.
             - Paul Jones, the distinguished art /*critic*/, died in his sleep last night.
          6) 状语
             - Wait a /*moment*/!
             - The watch costs ten /*pounds*/.
             - We must get together again some /*day*/.
          7) 独立成分
             - /*Miss*/, can you give me change for a dollar?
             - /*Martha*/, you look tired.
             - Your /*honour*/, I found this man outside St. Andrew's church an hour ago.
