English.html
<li><a id="org3755d44"></a>Sentence Structure<br />
<div class="outline-text-6" id="text-1-1-1-7-2">
<ol class="org-ol">
<li>Simple Sentence
<ul class="org-ul">
<li>Thomas Edison was born in Milan, Ohio, on February 11, 1847.</li>
<li>Fire and water do not agree.</li>
<li>Caroline came into the classroom and sat down.</li>
</ul></li>
<li>Compound Sentence
<ul class="org-ul">
<li>I came home early, but she remained to the end of the concert.</li>
</ul></li>
<li>Complex Sentence
<ul class="org-ul">
<li>He said he would come in the evening.</li>
<li>While the man worked to strenthen the dam, the rain continued to fall, and the river, which was already well above its normal level, rose higher and higher.</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="orgd0f1be7"></a>Purpose and use<br />
<div class="outline-text-6" id="text-1-1-1-7-3">
<ol class="org-ol">
<li>Declarative Sentence
<ul class="org-ul">
<li>The run rises in the east.</li>
</ul></li>
<li>Interrogative Sentence
<ul class="org-ul">
<li>Who is standing at the window?</li>
</ul></li>
<li>Imperative Sentence
<ul class="org-ul">
<li>Open the window, please.</li>
</ul></li>
<li>Exclamatory Sentence
<ul class="org-ul">
<li>How spotless the snow is!</li>
</ul></li>
</ol>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgf983d92" class="outline-4">
<h4 id="orgf983d92"><span class="section-number-4">1.1.2</span> Chapter 2 Noun</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org572f878"></a>概说<br />
<div class="outline-text-5" id="text-1-1-2-1">
<ol class="org-ol">
<li>名词的定义和特征
<ol class="org-ol">
<li>-s or -es
<ul class="org-ul">
<li>Jack shruggled his <i><b>shoulders</b></i>.</li>
<li>David stands six feet three <i><b>inches</b></i>.</li>
</ul></li>
<li>article
<ul class="org-ul">
<li><i><b>The chocolate</b></i> temporarily statisfied Ruth's <i><b>hunger</b></i>.</li>
<li><i><b>Some substances</b></i> resist <i><b>the action</b></i> of <i><b>acids</b></i>.</li>
</ul></li>
<li>固定的词序
<ul class="org-ul">
<li>The <i><b>organ</b></i> played a solemn <i><b>music</b></i>.</li>
<li>The <i><b>sun</b></i> evaporated the <i><b>dew</b></i>.</li>
</ul></li>
<li>独特的后缀
<ul class="org-ul">
<li>-er, -or, -ment, -ness, -ion, -ity, -ance(-ence), -ure, -al</li>
</ul></li>
</ol></li>
<li>名词的种类
<ol class="org-ol">
<li>Common Noun / Proper Noun
<ul class="org-ul">
<li><span class="underline">John</span> is a <span class="underline">student</span>.</li>
<li id="Proper Noun">零冠词，首字母大写</li>
</ul></li>
<li>Common Noun
<dl class="org-dl">
<dt>类名词</dt><dd>book, table, house</dd>
<dt>集体名词</dt><dd>family, crowd, army</dd>
<dt>物质名词</dt><dd>milk, water, honey</dd>
<dt>抽象名词</dt><dd>honesty, happiness, love</dd>
</dl></li>
<li>可数名词、不可数名词
<dl class="org-dl">
<dt>类名词和集体名词大多可数</dt><dd>a girl, a chair, a horse, a family, a tree, an army</dd>
<dt>物质名词、动作和抽象名词大多不可数</dt><dd>milk, thinking, glass, anger, drinking, honesty</dd>
</dl></li>
<li>简单名词、复合名词
<dl class="org-dl">
<dt>简单名词</dt><dd>mother, opinion, society, vase, wine, work</dd>
<dt>复合名词</dt><dd>raincoat, airman, sight-seeing, walking stick, self-consciousness, woman worker</dd>
</dl></li>
</ol></li>
<li>可数名词与不可数名词的区分
<ol class="org-ol">
<li>可数 :: duty, hope, experience</li>
<li>不可数 :: soap</li>
<li>可数 :: Two coffees, please.</li>
<li>不可数 :: Do you want tea or coffee?</li>
</ol></li>
<li>专有名词
<ol class="org-ol">
<li>人名</li>
<li>地名</li>
<li>时间名</li>
<li>报刊名
<ul class="org-ul">
<li>Time</li>
<li>Life</li>
<li>the Economist</li>
<li>the New Yorker</li>
<li>the Guardian</li>
<li>the Washington Post</li>
</ul></li>
<li>单位团体名多含普通名词，常带定冠词。如：
<ul class="org-ul">
<li>the Conservative Party</li>
<li>the Central Intelligence Agency</li>
<li>the Associated Press</li>
<li>the British Museum</li>
<li>the United Nations</li>
<li>Congress</li>
<li>Parliament</li>
<li>Yale University</li>
<li>Brown University</li>
</ul></li>
</ol></li>
<li>复合名词
<ol class="org-ol">
<li>构成大致有九种
<ol class="org-ol">
<li>名词+名词 :: daylight, goldfish, handbag, nightdress, oil well, snowball, teapot, warhorse</li>
<li>名词+动词 :: rainfall, haircut, book-keeping, horse-riding</li>
<li>名词+副词 :: passer-by, hanger-on</li>
<li>动词+名词 :: turntable, washing machine, punchcard, chewing gum, swimming-pool, writing desk</li>
<li>动词+副词 :: break-in, make-up, take-off, warm-up</li>
<li>形容词+名词 :: greenhouse, blackboard, shorthand, blueprint</li>
<li>形容词+动词 :: dry-cleaning</li>
<li>副词+名词 :: onlooker, bystander</li>
<li>副词+动词 :: offset, outlet, income, downturn</li>
</ol></li>
<li>形式有三种(连字符无规律，需查字典)
<ol class="org-ol">
<li>两部分连写 :: bookshop, motorcycle, lipstick, earrings, yearbook, tablecloth, fireplace, typewriter</li>
<li>两部分用连字符连接 :: ice-cream, baby-sitter, self-control, man-eater, drive-in, air-conditioning, summing-up, go-between</li>
<li>两部分分写 :: post office, toilet paper, film star, bus stop, side road, credit card, data bank, talcum powder</li>
</ol></li>
<li>重音在第一个词上
<ul class="org-ul">
<li>a 'blackbird 以别于 a black 'bird</li>
<li>the 'White House 以别于 the white house</li>
<li>an 'English teacher "英语教师" 与 an English 'teacher 英国教师</li>
</ul></li>
</ol></li>
<li>名词化(substantivization)
<ul class="org-ul">
<li>名词化的词类主要有下列四类
<ol class="org-ol">
<li>名词化的形容词 :: rich, dumb, poor, sick, blind, Scotch</li>
<li>名词化的过去分词 :: wounded, accused, unknown, beloved, outcast, firstborn</li>
<li>名词化的动名词 :: feeling, suffering, thinking, writing, printing, building</li>
<li>名词化的基数词、序数词 :: on all <i><b>fours</b></i>, in his <i><b>sixties</b></i>, from the <i><b>first</b></i>, need a <i><b>fourth</b></i> in the game</li>
</ol></li>
<li>其他词类及短语用作名词
<ul class="org-ul">
<li>I am not a <i><b>somebody</b></i>, but a <i><b>nobody</b></i>.</li>
<li>Did you enjoy your <i><b>swim</b></i>.</li>
<li>Motion requires a <i><b>here</b></i> and a <i><b>there</b></i>. 运动需要从这一点到那一点。</li>
<li>But me no <i><b>buts</b></i>. 你不要和我说”但是“、”但是“了。</li>
</ul></li>
<li>固定词组变成复合名词
<ul class="org-ul">
<li>to-do 吵闹</li>
<li>touch-me-not 含羞草</li>
<li>well-being 幸福，福利</li>
<li>has-been 过时的人或物</li>
<li>might-have-been 本可成功的人或本可做到的事</li>
<li>right-about-face 180 度大转弯</li>
</ul></li>
</ul></li>
<li>名词的功用
<ol class="org-ol">
<li>主语
<ul class="org-ul">
<li>The <i><b>boy</b></i> broke his arm yesterday.</li>
<li>/*William wants to become a judge.</li>
<li>A <i><b>watermelon</b></i> is much sweeter than a lemon.</li>
</ul></li>
<li>宾语
<ul class="org-ul">
<li>We lost our <i><b>way</b></i>.</li>
<li>Jeanette rarely misses a football <i><b>game</b></i>.</li>
<li>They've been working from <i><b>morning</b></i> to <i><b>night</b></i>.</li>
</ul></li>
<li>补语
<ul class="org-ul">
<li>Mark is considered a good <i><b>officer</b></i></li>
<li>The parents christened their son <i><b>John</b></i>.</li>
<li>The doctor is a <i><b>specialist</b></i> in diseases of heart.</li>
</ul></li>
<li>定语
<ul class="org-ul">
<li>The <i><b>air</b></i> conditioning works well.</li>
<li>The <i><b>ship's</b></i> crew stood on deck.</li>
<li>The <i><b>humanities</b></i> professor didn't give us any home-work tonight.</li>
</ul></li>
<li>同位语
<ul class="org-ul">
<li>Marilyn Monroe, a famous movie <i><b>star</b></i>, committed suicide.</li>
<li>Influenza, a common <i><b>disease</b></i>, has no cure.</li>
<li>Paul Jones, the distinguished art <i><b>critic</b></i>, died in his sleep last night.</li>
</ul></li>
<li>状语
<ul class="org-ul">
<li>Wait a <i><b>moment</b></i>!</li>
<li>The watch costs ten <i><b>pounds</b></i>.</li>
<li>We must get together again some <i><b>day</b></i>.</li>
</ul></li>
<li>独立成分
<ul class="org-ul">
<li><i><b>Miss</b></i>, can you give me change for a dollar?</li>
<li><i><b>Martha</b></i>, you look tired.</li>
<li>Your <i><b>honour</b></i>, I found this man outside St. Andrew's church an hour ago.</li>
</ul></li>
</ol></li>
</ol>
</div>
</li>
