English.org
**** 名词的数
       1. 数的含义和种类
          1) 单数(singular)表示”一“，复数表示”多于一“ :
             one half day, on day, one and a half days, two days, one or two days
          2) 单形名词表示单数概念，复形名词表示复数概念，如：
             - The /*pen*/ is mightier than the /*sword*/.
             - Two /*heads*/ are better than one.
          3) 数的概念与数的形式不一致
             - Can /*man*/ be free if /*woman*/ is a slave? (单数形式表示复数）
             - The /*barracks*/ is quite new. (复数形式表示单数)
          4) 规则复形名词-可数名词 :: dog - dogs, book - books
          5) 不规则复形名词-可数名词 :: foot - feet, child - children
          6) 不规则复形名词-通形名词 :: fish, sheep
          7) 不规则复形名词-外来词 :: creterion - creteria, bureau - bureaux
          8) 单形不变词-普通名词 :: butter, soap, courage
          9) 单形不变词-专有名词 :: John, James
          10) 复形不变词-普通名词 :: scissors, trousers, clothes, arms
          11) 复形不变词-专有名词 :: The alps, the West indies
       2. 名词的规则复数形式
| 构成方法   | 读音              | 例词               |
|------------+-------------------+--------------------|
| 在词尾加-s | 1.在清辅音后读/s/ | 1. desk - desks    |
|            | 2.在浊辅音后读/z/ | map - maps         |
|            |                   | boat - boats       |
|            |                   | lake - lakes       |
|            |                   | 2. field - fields  |
|            |                   | dog - dogs         |
|            |                   | sea - seas         |
|            |                   | machine - machines |
|------------+-------------------+--------------------|
| 1. 在   |                   |                    |
       4. 名词的不规则复数形式
       5. 不可数名词的数
       6. 集体名词的数
       7. 专有名词的数
       8. 名词化的词的数
       9. 复数名词的数
       10. 无单形的复形名词的数
       11. 某些名词单复形的比较
**** 名词的格
       1. 格的含义和种类
       2. 属格的形式
       3. 's 属格的构成方法
       4. 's 属格的其他用法
       5. 's 属格所修饰名词的省略
       6. 's 属格与通格的互用
       7. of 属格的用法
       8. 属格的功能
       9. 's 属格与 of 属格的互用
       10. 双重属格
**** 名词的性
       1. 性的含义和种类
       2. 表人的名词的性
       3. 表人的名词的双重性
       4. 集体名词的性
       5. 表高等动物名词的性
       6. 表低等动物、植物和非生物的名词的性
