English.html
<li><a id="org8e65871"></a>名词的数<br />
<div class="outline-text-5" id="text-1-1-2-2">
<ol class="org-ol">
<li>数的含义和种类
<ol class="org-ol">
<li>单数(singular)表示”一“，复数表示”多于一“ :
one half day, on day, one and a half days, two days, one or two days</li>
<li>单形名词表示单数概念，复形名词表示复数概念，如：
<ul class="org-ul">
<li>The <i><b>pen</b></i> is mightier than the <i><b>sword</b></i>.</li>
<li>Two <i><b>heads</b></i> are better than one.</li>
</ul></li>
<li>数的概念与数的形式不一致
<ul class="org-ul">
<li>Can <i><b>man</b></i> be free if <i><b>woman</b></i> is a slave? (单数形式表示复数）</li>
<li>The <i><b>barracks</b></i> is quite new. (复数形式表示单数)</li>
</ul></li>
<li>规则复形名词-可数名词 :: dog - dogs, book - books</li>
<li>不规则复形名词-可数名词 :: foot - feet, child - children</li>
<li>不规则复形名词-通形名词 :: fish, sheep</li>
<li>不规则复形名词-外来词 :: creterion - creteria, bureau - bureaux</li>
<li>单形不变词-普通名词 :: butter, soap, courage</li>
<li>单形不变词-专有名词 :: John, James</li>
<li>复形不变词-普通名词 :: scissors, trousers, clothes, arms</li>
<li>复形不变词-专有名词 :: The alps, the West indies</li>
</ol></li>
<li>名词的规则复数形式</li>
</ol>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">构成方法</th>
<th scope="col" class="org-left">读音</th>
<th scope="col" class="org-left">例词</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">在词尾加-s</td>
<td class="org-left">1.在清辅音后读/s/</td>
<td class="org-left">1.desk - desks</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">2.在浊辅音后读/z/</td>
<td class="org-left">map - maps</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">boat - boats</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">lake - lakes</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2.field - fields</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">dog - dogs</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">sea - seas</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">machine - machines</td>
</tr>
</tbody>
</table>
<ol class="org-ol">
<li>名词的不规则复数形式</li>
<li>不可数名词的数</li>
<li>集体名词的数</li>
<li>专有名词的数</li>
<li>名词化的词的数</li>
<li>复数名词的数</li>
<li>无单形的复形名词的数</li>
<li>某些名词单复形的比较</li>
</ol>
</div>
</li>
<li><a id="orge5b6ab2"></a>名词的格<br />
<div class="outline-text-5" id="text-1-1-2-3">
<ol class="org-ol">
<li>格的含义和种类</li>
<li>属格的形式</li>
<li>'s 属格的构成方法</li>
<li>'s 属格的其他用法</li>
<li>'s 属格所修饰名词的省略</li>
<li>'s 属格与通格的互用</li>
<li>of 属格的用法</li>
<li>属格的功能</li>
<li>'s 属格与 of 属格的互用</li>
<li>双重属格</li>
</ol>
</div>
</li>
<li><a id="org9583c13"></a>名词的性<br />
<div class="outline-text-5" id="text-1-1-2-4">
<ol class="org-ol">
<li>性的含义和种类</li>
<li>表人的名词的性</li>
<li>表人的名词的双重性</li>
<li>集体名词的性</li>
<li>表高等动物名词的性</li>
<li>表低等动物、植物和非生物的名词的性</li>
</ol>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhong Wei</p>
<p class="date">Created: 2017-10-08 Sun 09:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
